docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
    <meta http-equiv="Content-Type" content=
    "text/html; charset=utf-8" />
    <meta name="viewport" content=
    "width=device-width, initial-scale=1" />
    <title>Yoda</title>
    <meta name="author" content="Simon Sölder" />
    <meta name="generator" content="Org Mode" />
    <link rel="stylesheet" type="text/css" href=
    "https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css" />
    <link rel="stylesheet" type="text/css" href=
    "https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css" />

</head>
<body>
    <div id="content">
        <h1 class="title">Yoda<br />
        <span class="subtitle">Interactive Prototyping
        2</span></h1>
        <div id="table-of-contents">
            <h2>Table of Contents</h2>
            <div id="text-table-of-contents">
                <ul>
                    <li>
                        <a href="#org9ae745d">1. Introduction</a>
                        <ul>
                            <li><a href="#org5a4d0ae">1.1. Quick
                            Overview</a></li>
                            <li><a href="#orgc5db564">1.2.
                            Terminology</a></li>
                        </ul>
                    </li>
                    <li><a href="#orga23f2dc">2. What changed over
                    the course of prototyping?</a></li>
                    <li><a href="#orgea4df45">3. How it
                    works</a></li>
                    <li><a href="#orga80151e">4. Bill of
                    Materials</a></li>
                    <li><a href="#orgf8332a2">5. Resources</a></li>
                </ul>
            </div>
        </div>
        <div id="outline-container-org9ae745d" class="outline-2">
            <h2 id="org9ae745d"><span class=
            "section-number-2">1</span> Introduction</h2>
            <div class="outline-text-2" id="text-1">
                <p><b>Yoda</b> is a project, which is being
                prototyped for the final assignment of the class
                “Interactive Prototyping &amp; Physical Computing
                2” in the MMT Study of the University of Applied
                Sciences Salzburg. The aim of this prototype is to
                explore various possibilities to interact and
                control devices by using a series of pre-defined
                hand gestures.</p>
            </div>
            <div id="outline-container-org5a4d0ae" class=
            "outline-3">
                <h3 id="org5a4d0ae"><span class=
                "section-number-3">1.1</span> Quick Overview</h3>
                <div class="outline-text-3" id="text-1-1">
                    <ul class="org-ul">
                        <li>Gesture Control Interface which maps
                        gestures to commands and sends them over a
                        proxy to (multiple) clients via
                        websockets</li>
                        <li>Gesture recognition happens on a
                        <code>RaspberryPi 4B</code> using the
                        <code>Skywriter Hat</code> 3D gesture
                        sensing board.</li>
                        <li>Written in <code>python3</code>,
                        <code>javascript</code> and
                        <code>C#</code>.</li>
                        <li>Can be used everywhere as long as
                        network communication can happen</li>
                        <li>Can be used on multiple devices as the
                        gesture-to-action mapping happens on the
                        client itself. The clients can freely
                        choose which command should map to which
                        action.</li>
                        <li>Client tested on Linux, however it
                        should work on every client where
                        <code>.NET5.0</code> can be used</li>
                    </ul>
                </div>
            </div>
            <div id="outline-container-orgc5db564" class=
            "outline-3">
                <h3 id="orgc5db564"><span class=
                "section-number-3">1.2</span> Terminology</h3>
                <div class="outline-text-3" id="text-1-2">
                    <p>This section desribes the terminology used
                    throughout the following text:</p>
                    <ul class="org-ul">
                        <li><b>gesture</b>: A hand gesture which is
                        being captured with the <code>Skywriter
                        Hat</code> board. (e.g. Flick, Tap, …)</li>
                        <li><b>message/payload</b>: JSON-encoded
                        message containing information about the
                        envoked gesture. It gets send over the
                        network to various clients.</li>
                        <li><b>action</b>: This desribes an action
                        that is mapped to a specific gesture (e.g a
                        progrem that gets executed due to a
                        specific gesture)</li>
                    </ul>
                </div>
            </div>
        </div>
        <div id="outline-container-orga23f2dc" class="outline-2">
            <h2 id="orga23f2dc"><span class=
            "section-number-2">2</span> What changed over the
            course of prototyping?</h2>
            <div class="outline-text-2" id="text-2">
                <p>The initial plan was to utilize the Raspberry Pi
                Camera Module to detect gestures using the
                <code>Google Tensorflow</code> framework, which
                failed due to the non-existing native ARM support
                and a number of problems while trying to compile it
                for said platform. Using the training scripts
                provided by ARM-software in <a href=
                "https://github.com/ARM-software/ML-examples">this
                repo</a>, the AI could be trained - as several
                training iterations did not yield satisfying
                results (detection ratio was still very low), the
                project shifted towards using a <code>Skywriter
                Hat</code> as the input module - whereas not as
                powerful as the AI approach, it worked out great in
                the end.</p>
            </div>
        </div>
        <div id="outline-container-orgea4df45" class="outline-2">
            <h2 id="orgea4df45"><span class=
            "section-number-2">3</span> How it works</h2>
        </div>
        <div id="outline-container-orga80151e" class="outline-2">
            <h2 id="orga80151e"><span class=
            "section-number-2">4</span> Bill of Materials</h2>
            <div class="outline-text-2" id="text-4">
                <table border="2" cellspacing="0" cellpadding="6"
                rules="groups" frame="hsides">
                    <colgroup>
                        <col class="org-left" />
                        <col class="org-right" />
                        <col class="org-left" />
                    </colgroup>
                    <thead>
                        <tr>
                            <th scope="col" class="org-left">
                            Material/Device</th>
                            <th scope="col" class="org-right">
                            Quantity</th>
                            <th scope="col" class="org-left">est.
                            Cost</th>
                        </tr>
                    </thead>
                    <tbody>
                        <tr>
                            <td class="org-left">RaspberryPi 4B
                            4GB</td>
                            <td class="org-right">1</td>
                            <td class="org-left">58€</td>
                        </tr>
                        <tr>
                            <td class="org-left">Power Supply 5V
                            3A</td>
                            <td class="org-right">1</td>
                            <td class="org-left">9€</td>
                        </tr>
                        <tr>
                            <td class="org-left">microSD Card
                            16GB</td>
                            <td class="org-right">1</td>
                            <td class="org-left">6€</td>
                        </tr>
                        <tr>
                            <td class="org-left">Skywriter Hat</td>
                            <td class="org-right">1</td>
                            <td class="org-left">23€</td>
                        </tr>
                        <tr>
                            <td class="org-left">Case</td>
                            <td class="org-right">1</td>
                            <td class="org-left">-</td>
                        </tr>
                    </tbody>
                </table>
            </div>
        </div>
        <div id="outline-container-orgf8332a2" class="outline-2">
            <h2 id="orgf8332a2"><span class=
            "section-number-2">5</span> Resources</h2>
        </div>
    </div>
    <div id="postamble" class="status">
        <p class="author">Author: Simon Sölder</p>
    </div>
</body>
</html>
